#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.my_s3_bucket.module.s3_bucket.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.data.aws_region.current: Reading...[0m[0m
[0m[1maws_ssm_parameter.private_subnets_cidr_block: Refreshing state... [id=/dev/my_vpc/private_subnets_cidr_block][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-072e0cda4cfe099f7][0m
[0m[1maws_ssm_parameter.public_subnets_cidr_block: Refreshing state... [id=/dev/my_vpc/public_subnets_cidr_block][0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=educationist-flow-logs][0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.data.aws_region.current: Read complete after 0s [id=eu-west-3][0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=125169409170][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-096edcc75f5f334e2][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d20b857477804442][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ef1b297584481aad][0m
[0m[1maws_ssm_parameter.vpc_default_security_group_id: Refreshing state... [id=/dev/my_vpc/subnets/vpc_default_security_group_id][0m
[0m[1maws_ssm_parameter.vpc_cidr_block: Refreshing state... [id=/dev/my_vpc/vpc_cidr_block][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ab702dfe63e6ea2e][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ce0b24946ccebb3e][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-081e412d56a5f81d0][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0068146aaaf85e0d7][0m
[0m[1maws_ssm_parameter.vpc_id: Refreshing state... [id=/dev/my_vpc/vpc_id][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0857563a4c8e70784][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a7c1a8d3b366c49c][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0535c19a1a863ae65][0m
[0m[1mmodule.my_vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-03b96c9319b50aee8][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08680799df6b7ec14][0m
[0m[1maws_ssm_parameter.private_subnets_id: Refreshing state... [id=/dev/my_vpc/subnets/private_subnets_id][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-036c3397ee70ab22e][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0766783582626eea4][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=my-vpc][0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=educationist-flow-logs][0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=educationist-flow-logs][0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.data.aws_iam_policy_document.combined[0]: Reading...[0m[0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=1027700251][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-039fe80b50ca68c1f][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a7c1a8d3b366c49c1080289494][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09d588f1755d09f21][0m
[0m[1maws_ssm_parameter.public_subnets_id: Refreshing state... [id=/dev/my_vpc/subnets/public_subnets_id][0m
[0m[1mmodule.my_s3_bucket.module.s3_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=educationist-flow-logs][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0899696a84925e750][0m
[0m[1mmodule.my_vpc.module.my_vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ce0b24946ccebb3e1080289494][0m
[0m[1maws_ssm_parameter.database_subnet_group: Refreshing state... [id=/dev/my_vpc/subnets/database_subnet_group][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.my_vpc.module.my_vpc.aws_flow_log.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_flow_log" "this" {
      [32m+[0m[0m arn                      = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m log_destination          = "arn:aws:s3:::educationist-flow-logs"
      [32m+[0m[0m log_destination_type     = "s3"
      [32m+[0m[0m log_format               = (known after apply)
      [32m+[0m[0m log_group_name           = (known after apply)
      [32m+[0m[0m max_aggregation_interval = 600
      [32m+[0m[0m tags                     = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                 = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m traffic_type             = "ALL"
      [32m+[0m[0m vpc_id                   = "vpc-072e0cda4cfe099f7"

      [32m+[0m[0m destination_options {
          [32m+[0m[0m file_format                = "plain-text"
          [32m+[0m[0m hive_compatible_partitions = false
          [32m+[0m[0m per_hour_partition         = false
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @OriAvr, Action: `pull_request`*